use std::fmt::Display;

use LunarDay::*;

#[cfg(feature = "serde")]
use serde::Serialize;

#[cfg(feature = "swagger")]
use utoipa::ToSchema;

// 月份分为大月和小月，大月三十天，小月二十九天
#[cfg_attr(feature = "serde", derive(Serialize))]
#[cfg_attr(feature = "swagger", derive(ToSchema))]
#[derive(Debug, Clone, Copy)]
pub enum LunarDay {
    初一,
    初二,
    初三,
    初四,
    初五,
    初六,
    初七,
    初八,
    初九,
    初十,
    十一,
    十二,
    十三,
    十四,
    十五,
    十六,
    十七,
    十八,
    十九,
    二十,
    廿一,
    廿二,
    廿三,
    廿四,
    廿五,
    廿六,
    廿七,
    廿八,
    廿九,
    三十,
}

impl LunarDay {
    pub fn to_num(&self) -> u8 {
        match self {
            初一 => 1,
            初二 => 2,
            初三 => 3,
            初四 => 4,
            初五 => 5,
            初六 => 6,
            初七 => 7,
            初八 => 8,
            初九 => 9,
            初十 => 10,
            十一 => 11,
            十二 => 12,
            十三 => 13,
            十四 => 14,
            十五 => 15,
            十六 => 16,
            十七 => 17,
            十八 => 18,
            十九 => 19,
            二十 => 20,
            廿一 => 21,
            廿二 => 22,
            廿三 => 23,
            廿四 => 24,
            廿五 => 25,
            廿六 => 26,
            廿七 => 27,
            廿八 => 28,
            廿九 => 29,
            三十 => 30,
        }
    }
}

impl Display for LunarDay {
    fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
        let s = match self {
            初一 => "初一",
            初二 => "初二",
            初三 => "初三",
            初四 => "初四",
            初五 => "初五",
            初六 => "初六",
            初七 => "初七",
            初八 => "初八",
            初九 => "初九",
            初十 => "初十",
            十一 => "十一",
            十二 => "十二",
            十三 => "十三",
            十四 => "十四",
            十五 => "十五",
            十六 => "十六",
            十七 => "十七",
            十八 => "十八",
            十九 => "十九",
            二十 => "二十",
            廿一 => "廿一",
            廿二 => "廿二",
            廿三 => "廿三",
            廿四 => "廿四",
            廿五 => "廿五",
            廿六 => "廿六",
            廿七 => "廿七",
            廿八 => "廿八",
            廿九 => "廿九",
            三十 => "三十",
        };

        write!(f, "{}", s)
    }
}

pub const DAY_NAMES: [LunarDay; 30] = [
    初一, 初二, 初三, 初四, 初五, 初六, 初七, 初八, 初九, 初十, 十一, 十二, 十三, 十四, 十五, 十六,
    十七, 十八, 十九, 二十, 廿一, 廿二, 廿三, 廿四, 廿五, 廿六, 廿七, 廿八, 廿九, 三十,
];
